setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-14 sáb 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My neovim/emacs config for python</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">My neovim/emacs config for python</h1>

<div id="outline-container-orgd33bfff" class="outline-2">
<h2 id="orgd33bfff"><span class="section-number-2">1</span> Fresh linux install</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1642dc6" class="outline-3">
<h3 id="org1642dc6"><span class="section-number-3">1.1</span> update pacman package databse</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> pacman -Syu
</pre>
</div>
</div>
</div>
<div id="outline-container-org712f256" class="outline-3">
<h3 id="org712f256"><span class="section-number-3">1.2</span> get yay</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> pacman -S <span style="color: #ECBE7B;">git</span>
<span style="color: #ECBE7B;">git</span> clone https://aur.archlinux.org/yay.git
<span style="color: #ECBE7B;">cd</span> yay
makepkg -si
</pre>
</div>
</div>
</div>
<div id="outline-container-org9b459df" class="outline-3">
<h3 id="org9b459df"><span class="section-number-3">1.3</span> swap caps lock and escape</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgf0552aa" class="outline-4">
<h4 id="orgf0552aa"><span class="section-number-4">1.3.1</span> get xcape</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-shell">pacman -S xcape
</pre>
</div>
</div>
</div>
<div id="outline-container-org6badc1b" class="outline-4">
<h4 id="org6badc1b"><span class="section-number-4">1.3.2</span> add this to ~/.xprofile</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
setxkbmap us -option 'caps:ctrl_modifier'
xcape -e 'Caps_Lock=Escape'
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ebb057" class="outline-3">
<h3 id="org8ebb057"><span class="section-number-3">1.4</span> clone my <a href="https://github.com/https://github.com/Adarah/my_configs">git repo</a></h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> pacman -S <span style="color: #ECBE7B;">git</span>
<span style="color: #ECBE7B;">git</span> clone <span style="color: #ECBE7B;">git</span>@github.com:Adarah/my_configs.git
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7587a68" class="outline-2">
<h2 id="org7587a68"><span class="section-number-2">2</span> ZSH</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org00e6ba0" class="outline-3">
<h3 id="org00e6ba0"><span class="section-number-3">2.1</span> installation</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> pacman -S zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc3fc17" class="outline-3">
<h3 id="orgfc3fc17"><span class="section-number-3">2.2</span> <a href="https://github.com/ohmyzsh/ohmyzsh">oh-my-zsh</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Follow the installations guide.<br />
</p>
</div>
</div>
<div id="outline-container-orgd8f16ba" class="outline-3">
<h3 id="orgd8f16ba"><span class="section-number-3">2.3</span> <a href="https://github.com/romkatv/powerlevel10k">powerline 10k</a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Follow the installation guide.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org44488aa" class="outline-2">
<h2 id="org44488aa"><span class="section-number-2">3</span> neovim</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0178353" class="outline-3">
<h3 id="org0178353"><span class="section-number-3">3.1</span> installation</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> pacman -S neovim
</pre>
</div>
</div>
<div id="outline-container-org8d615e7" class="outline-4">
<h4 id="org8d615e7"><span class="section-number-4">3.1.1</span> add these to .zshrc</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">EDITOR</span>=/usr/bin/nvim
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">VISUAL</span>=/usr/bin/nvim
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org24fd616" class="outline-3">
<h3 id="org24fd616"><span class="section-number-3">3.2</span> copy the config file</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">mkdir</span> ~/.config/nvim
<span style="color: #ECBE7B;">cp</span> my_configs/init.vim ~/.config/nvim/
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d0f943" class="outline-2">
<h2 id="org4d0f943"><span class="section-number-2">4</span> emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb856229" class="outline-3">
<h3 id="orgb856229"><span class="section-number-3">4.1</span> install emacs (AUR)</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-shell">yay -S emacs-git
</pre>
</div>
</div>
</div>
<div id="outline-container-org8750ee3" class="outline-3">
<h3 id="org8750ee3"><span class="section-number-3">4.2</span> <a href="https://github.com/hlissner/doom-emacs">Doom emacs</a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Follow the installation guide.<br />
Don&rsquo;t forget to add it to the PATH in your zsh.rc file<br />
</p>
<pre class="example">
export PATH=$PATH:~/.emacs/bin/
</pre>
<p>
copy the hidden config files from my repos to .doom.d<br />
If using lsp, don&rsquo;t forget to run M-x lsp-install-server<br />
</p>
</div>
<div id="outline-container-org035af75" class="outline-4">
<h4 id="org035af75"><span class="section-number-4">4.2.1</span> <a href="https://github.com/hlissner/doom-emacs/blob/develop/modules/lang/python/README.org">some python options that are worth taking a look at</a></h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="org696f4f6"></a>lsp<br /></li>
<li><a id="org8a9cfa2"></a>py-isort<br /></li>
<li><a id="orgeb68213"></a>pyenv<br /></li>
<li><a id="orgc6fd77e"></a>cython<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf01c904" class="outline-2">
<h2 id="orgf01c904"><span class="section-number-2">5</span> python</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb9a9ac2" class="outline-3">
<h3 id="orgb9a9ac2"><span class="section-number-3">5.1</span> pyenv installation</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">curl</span> https://pyenv.run | zsh
</pre>
</div>
</div>
<div id="outline-container-org70ac160" class="outline-4">
<h4 id="org70ac160"><span class="section-number-4">5.1.1</span> don&rsquo;t forget to add it to the path</h4>
</div>
</div>
<div id="outline-container-org795ee36" class="outline-3">
<h3 id="org795ee36"><span class="section-number-3">5.2</span> poetry installation</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">curl</span> -sSL https://raw.githubusercontent.com/python-poetry/poetry/master/get-poet<span style="color: #ffffff; background-color: brightblack;">r</span>y.py | python
</pre>
</div>
<p>
the tutorial for zsh autocompletion is broken, <a href="https://github.com/python-poetry/poetry/issues/1734">follow this link</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-03-14 sáb 20:07</p>
</div>
</body>
</html>
